package BotGameCoutry;

import java.lang.reflect.Array;
import java.util.*;

public class Brains{


    static public String [][][] C = new String[29][60][2];

    public Brains() {
        hz();
    }



    public String sayInReturn(String msg)throws Exception {
        //Random random = new Random();
        msg = msg.substring(0, 1).toUpperCase() + msg.substring(1).toLowerCase();
        try {
            if (!CheckWords(msg)) {
                return ">>> not found word";
            } else {

                DeleteWords(msg);
                int i = 0;
                String answer = "You win";
                int count = 0;
                switch (msg.substring(msg.length() - 1).toUpperCase()) { //+
                    case "А":
                        i = 0;
                        break;
                    case "Б":
                        i = 1;
                        break;
                    case "В":
                        i = 2;
                        break;
                    case "Г":
                        i = 3;
                        break;
                    case "Д":
                        i = 4;
                        break;
                    case "Е":
                        i = 5;
                        break;
                    case "Ж":
                        i = 6;
                        break;
                    case "З":
                        i = 7;
                        break;
                    case "И":
                        i = 8;
                        break;
                    case "Й":
                        i = 9;
                        break;
                    case "К":
                        i = 10;
                        break;
                    case "Л":
                        i = 11;
                        break;
                    case "М":
                        i = 12;
                        break;
                    case "Н":
                        i = 13;
                        break;
                    case "О":
                        i = 14;
                        break;
                    case "П":
                        i = 15;
                        break;
                    case "Р":
                        i = 16;
                        break;
                    case "С":
                        i = 17;
                        break;
                    case "Т":
                        i = 18;
                        break;
                    case "У":
                        i = 19;
                        break;
                    case "Ф":
                        i = 20;
                        break;
                    case "Х":
                        i = 21;
                        break;
                    case "Ц":
                        i = 22;
                        break;
                    case "Ч":
                        i = 23;
                        break;
                    case "Ш":
                        i = 24;
                        break;
                    case "Щ":
                        i = 25;
                        break;
                    case "Э":
                        i = 26;
                        break;
                    case "Ю":
                        i = 27;
                        break;
                    case "Я":
                        i = 28;
                        break;
                }

                count = 0;
                //пофиксить выход за пределы массива
                while (C[i][count][1] == "1") {
                    count++;
                }
                answer = C[i][count][0];

                if (C[i][count][0] == null) {
                    answer = ">>> You winn";
                }
                C[i][count][1] = "1";

                return ">>> " + answer;
            }
        } catch(StringIndexOutOfBoundsException e){
                return "Куку ёптыть";
        }
    }


        private void DeleteWords(String s) throws Exception{
            try {
                int i = 0;
                switch (s.substring(0, 1)) {
                    case "А":
                        i = 0;
                        break;
                    case "Б":
                        i = 1;
                        break;
                    case "В":
                        i = 2;
                        break;
                    case "Г":
                        i = 3;
                        break;
                    case "Д":
                        i = 4;
                        break;
                    case "Е":
                        i = 5;
                        break;
                    case "Ж":
                        i = 6;
                        break;
                    case "З":
                        i = 7;
                        break;
                    case "И":
                        i = 8;
                        break;
                    case "Й":
                        i = 9;
                        break;
                    case "К":
                        i = 10;
                        break;
                    case "Л":
                        i = 11;
                        break;
                    case "М":
                        i = 12;
                        break;
                    case "Н":
                        i = 13;
                        break;
                    case "О":
                        i = 14;
                        break;
                    case "П":
                        i = 15;
                        break;
                    case "Р":
                        i = 16;
                        break;
                    case "С":
                        i = 17;
                        break;
                    case "Т":
                        i = 18;
                        break;
                    case "У":
                        i = 19;
                        break;
                    case "Ф":
                        i = 20;
                        break;
                    case "Х":
                        i = 21;
                        break;
                    case "Ц":
                        i = 22;
                        break;
                    case "Ч":
                        i = 23;
                        break;
                    case "Ш":
                        i = 24;
                        break;
                    case "Щ":
                        i = 25;
                        break;
                    case "Э":
                        i = 26;
                        break;
                    case "Ю":
                        i = 27;
                        break;
                    case "Я":
                        i = 28;
                        break;
                }
                for (int j = 0; j < C[i].length; j++) {
                    if (C[i][j][0].contains(s)) {
                        C[i][j][1] = "1";
                    }
                }
            }
            catch (NullPointerException e){
            }
        }


        private boolean CheckWords(String s){
            boolean b = true;
            for (int i = 0; i < C.length; i++){
                for (int j = 0; j < C[i].length; j++){
                    if(C[i][j][0].contains(s))
                        b = false;
                        break;
                }
            }
            return b;
        }

        private void hz (){
            for(int i = 0; i < C0.length; i++){
                for(int j = 0; j < 2; j++){
                    C[0][i][j] = C0[i][j];
                }
            }
            for(int i = 0; i < C1.length; i++){
                for(int j = 0; j < 2; j++){
                    C[1][i][j] = C1[i][j];
                }
            }
            for(int i = 0; i < C2.length; i++){
                for(int j = 0; j < 2; j++){
                    C[2][i][j] = C2[i][j];
                }
            }
            for(int i = 0; i < C3.length; i++){
                for(int j = 0; j < 2; j++){
                    C[3][i][j] = C3[i][j];
                }
            }
            for(int i = 0; i < C4.length; i++){
                for(int j = 0; j < 2; j++){
                    C[4][i][j] = C4[i][j];
                }
            }
            for(int i = 0; i < C5.length; i++){
                for(int j = 0; j < 2; j++){
                    C[5][i][j] = C5[i][j];
                }
            }
            for(int i = 0; i < C6.length; i++){
                for(int j = 0; j < 2; j++){
                    C[6][i][j] = C6[i][j];
                }
            }
            for(int i = 0; i < C7.length; i++){
                for(int j = 0; j < 2; j++){
                    C[7][i][j] = C7[i][j];
                }
            }
            for(int i = 0; i < C8.length; i++){
                for(int j = 0; j < 2; j++){
                    C[8][i][j] = C8[i][j];
                }
            }
            for(int i = 0; i < C9.length; i++){
                for(int j = 0; j < 2; j++){
                    C[9][i][j] = C9[i][j];
                }
            }
            for(int i = 0; i < C10.length; i++){
                for(int j = 0; j < 2; j++){
                    C[10][i][j] = C10[i][j];
                }
            }
            for(int i = 0; i < C11.length; i++){
                for(int j = 0; j < 2; j++){
                    C[11][i][j] = C11[i][j];
                }
            }
            for(int i = 0; i < C12.length; i++){
                for(int j = 0; j < 2; j++){
                    C[12][i][j] = C12[i][j];
                }
            }
            for(int i = 0; i < C13.length; i++){
                for(int j = 0; j < 2; j++){
                    C[13][i][j] = C13[i][j];
                }
            }
            for(int i = 0; i < C14.length; i++){
                for(int j = 0; j < 2; j++){
                    C[14][i][j] = C14[i][j];
                }
            }
            for(int i = 0; i < C15.length; i++){
                for(int j = 0; j < 2; j++){
                    C[15][i][j] = C15[i][j];
                }
            }
            for(int i = 0; i < C16.length; i++){
                for(int j = 0; j < 2; j++){
                    C[16][i][j] = C16[i][j];
                }
            }
            for(int i = 0; i < C17.length; i++){
                for(int j = 0; j < 2; j++){
                    C[17][i][j] = C17[i][j];
                }
            }
            for(int i = 0; i < C18.length; i++){
                for(int j = 0; j < 2; j++){
                    C[18][i][j] = C18[i][j];
                }
            }
            for(int i = 0; i < C19.length; i++){
                for(int j = 0; j < 2; j++){
                    C[19][i][j] = C19[i][j];
                }
            }
            for(int i = 0; i < C20.length; i++){
                for(int j = 0; j < 2; j++){
                    C[20][i][j] = C20[i][j];
                }
            }
            for(int i = 0; i < C21.length; i++){
                for(int j = 0; j < 2; j++){
                    C[21][i][j] = C21[i][j];
                }
            }
            for(int i = 0; i < C22.length; i++){
                for(int j = 0; j < 2; j++){
                    C[22][i][j] = C22[i][j];
                }
            }
            for(int i = 0; i < C23.length; i++){
                for(int j = 0; j < 2; j++){
                    C[23][i][j] = C23[i][j];
                }
            }
            for(int i = 0; i < C24.length; i++){
                for(int j = 0; j < 2; j++){
                    C[24][i][j] = C24[i][j];
                }
            }
            for(int i = 0; i < C25.length; i++){
                for(int j = 0; j < 2; j++){
                    C[25][i][j] = C25[i][j];
                }
            }
            for(int i = 0; i < C26.length; i++){
                for(int j = 0; j < 2; j++){
                    C[26][i][j] = C26[i][j];
                }
            }
            for(int i = 0; i < C27.length; i++){
                for(int j = 0; j < 2; j++){
                    C[27][i][j] = C27[i][j];
                }
            }
            for(int i = 0; i < C28.length; i++){
                for(int j = 0; j < 2; j++){
                    C[28][i][j] = C28[i][j];
                }
            }
        }
        final String[][] C0 = {{"Аахен (Германия)", "0"},
                {"Абакан (Россия)", "0"},
                {"Абу-Даби (ОАЭ)", "0"},
                {"Агадир (Марокко)", "0"},
                {"Агиос-Николаос (Греция)", "0"},
                {"Адлер (Россия) ", "0"},
                {"Аделаида (Австралия)", "0"},
                {"Аджман (ОАЭ)", "0"},
                {"Айя-Напа (Кипр)", "0"},
                {"Акаба (Иордания)", "0"},
                {"Акапулько (Мексика)", "0"},
                {"Аккра (Гана)", "0"},
                {"Аланья (Турция)", "0"},
                {"Албена (Болгария)", "0"},
                {"Александрия (Египет)", "0"},
                {"Алеппо (Сирия)", "0"},
                {"Алжир (Алжир)", "0"},
                {"Аликанте (Испания)", "0"},
                {"Алматы (Казахстан) ", "0"},
                {"Алупка (Россия) ", "0"},
                {"Алушта (Россия) ", "0"},
                {"Альмерия (Испания)", "0"},
                {"Амальфи (Италия)", "0"},
                {"Амман (Иордания)", "0"},
                {"Амстердам (Нидерланды)", "0"},
                {"Анадырь (Россия)", "0"},
                {"Анапа (Россия) ", "0"},
                {"Анкара (Турция)", "0"},
                {"Анкона (Италия)", "0"},
                {"Анкоридж (США)", "0"},
                {"Анталия (Турция)", "0"},
                {"Антверпен (Бельгия)", "0"},
                {"Антиб (Франция)", "0"},
                {"Армавир (Россия) ", "0"},
                {"Архангельск (Россия)", "0"},
                {"Астана (Казахстан)", "0"},
                {"Астрахань (Россия)", "0"},
                {"Атланта (США)", "0"},
                {"Аугсбург (Германия)", "0"},
                {"Афины (Греция)", "0"},
                {"Ашдод (Израиль)", "0"},
                {"Ашкелон (Израиль)", "0"},
                {"Ашхабад (Туркменистан)", "0"}};

        final String[][] C1 = {{"Багдад (Ирак)", "0"},
                {"Базель (Швейцария)", "0"},
                {"Баку (Азербайджан)", "0"},
                {"Балчик (Болгария)", "0"},
                {"Бангалор (Индия)", "0"},
                {"Бангкок (Таиланд)", "0"},
                {"Банско (Болгария)", "0"},
                {"Бар (Черногория)", "0"},
                {"Бари (Италия)", "0"},
                {"Барнаул (Россия)", "0"},
                {"Барселона (Испания)", "0"},
                {"Бейрут (Ливан)", "0"},
                {"Белгород (Россия)", "0"},
                {"Белград (Сербия)", "0"},
                {"Белек (Турция)", "0"},
                {"Белосток (Польша)", "0"},
                {"Белфаст (Великобритания)", "0"},
                {"Бенидорм (Испания)", "0"},
                {"Берген (Норвегия)", "0"},
                {"Берлин (Германия)", "0"},
                {"Берн (Швейцария)", "0"},
                {"Бийск (Россия) ", "0"},
                {"Бильбао (Испания)", "0"},
                {"Бирмингем (Великобритания)", "0"},
                {"Бишкек (Киргизия)", "0"},
                {"Благовещенск (Россия)", "0"},
                {"Бланес (Испания)", "0"},
                {"Богота (Колумбия)", "0"},
                {"Бодрум (Турция)", "0"},
                {"Болонья (Италия)", "0"},
                {"Бонн (Германия)", "0"},
                {"Бордо (Франция)", "0"},
                {"Бостон (США)", "0"},
                {"Бразилиа (Бразилия)", "0"},
                {"Братислава (Словакия)", "0"},
                {"Братск (Россия)", "0"},
                {"Брашов (Румыния)", "0"},
                {"Бремен (Германия)", "0"},
                {"Брест (Белоруссия)", "0"},
                {"Брест (Франция)", "0"},
                {"Брисбен (Австралия)", "0"},
                {"Бристоль (Великобритания)", "0"},
                {"Брно (Чехия)", "0"},
                {"Брюгге (Бельгия)", "0"},
                {"Брюссель (Бельгия)", "0"},
                {"Брянск (Россия)", "0"},
                {"Будапешт (Венгрия)", "0"},
                {"Будва (Черногория)", "0"},
                {"Бургас (Болгария)", "0"},
                {"Бухарест (Румыния)", "0"},
                {"Буэнос-Айрес (Аргентина)", "0"}};
        final String[][] C2 = {{"Валенсия (Испания)", "0"},
                {"Валетта (Мальта)", "0"},
                {"Веллингтон (Новая Зеландия)", "0"},
                {"Ванкувер (Канада)", "0"},
                {"Варадеро (Куба)", "0"},
                {"Варна (Болгария)", "0"},
                {"Варшава (Польша)", "0"},
                {"Вашингтон (США)", "0"},
                {"Вена (Австрия)", "0"},
                {"Венеция (Италия)", "0"},
                {"Верона (Италия)", "0"},
                {"Вильнюс (Литва)", "0"},
                {"Виннипег (Канада)", "0"},
                {"Винница (Украина)", "0"},
                {"Висбаден (Германия)", "0"},
                {"Витебск (Белоруссия)", "0"},
                {"Вифлеем (Палестина)", "0"},
                {"Владивосток (Россия)", "0"},
                {"Владикавказ (Россия)", "0"},
                {"Владимир (Россия)", "0"},
                {"Волгоград (Россия)", "0"},
                {"Вологда (Россия)", "0"},
                {"Воркута (Россия) ", "0"},
                {"Воронеж (Россия)", "0"},
                {"Вроцлав (Польша)", "0"},
                {"Вьентьян (Лаос)", "0"}};
        final String[][] C3 = {{"Гаага (Нидерланды)", "0"},
                {"Гавана (Куба)", "0"},
                {"Галле (Шри-Ланка)", "0"},
                {"Гамбург (Германия)", "0"},
                {"Ганновер (Германия)", "0"},
                {"Гданьск (Польша)", "0"},
                {"Гдыня (Польша)", "0"},
                {"Геленджик (Россия) ", "0"},
                {"Гент (Бельгия)", "0"},
                {"Генуя (Италия)", "0"},
                {"Герат (Афганистан)", "0"},
                {"Гетеборг (Швеция)", "0"},
                {"Глазго (Великобритания)", "0"},
                {"Гоа (Индия)", "0"},
                {"Гомель (Белоруссия)", "0"},
                {"Гонконг (Китай)", "0"},
                {"Гонолулу (США)", "0"},
                {"Горно-Алтайск (Россия) ", "0"},
                {"Гранада (Испания)", "0"},
                {"Грац (Австрия)", "0"},
                {"Гренобль (Франция)", "0"},
                {"Гродно (Белоруссия)", "0"},
                {"Грозный (Россия)", "0"},
                {"Гуантанамо (Куба)", "0"},
                {"Гуанчжоу (Китай)", "0"}};
        final String[][] C4 = {{"Давос (Швейцария)", "0"},
                {"Дакка (Бангладеш)", "0"},
                {"Далат (Вьетнам)", "0"},
                {"Далянь (Китай)", "0"},
                {"Дамаск (Сирия)", "0"},
                {"Дананг (Вьетнам)", "0"},
                {"Дар-эс-Салам (Танзания)", "0"},
                {"Дахаб (Египет)", "0"},
                {"Дебрецен (Венгрия)", "0"},
                {"Дели (Индия)", "0"},
                {"Денпасар (Индонезия)", "0"},
                {"Детройт (США)", "0"},
                {"Джайпур (Индия)", "0"},
                {"Джакарта (Индонезия)", "0"},
                {"Джерба (Тунис)", "0"},
                {"Джидда (Саудовская Аравия)", "0"},
                {"Дзержинск (Россия) ", "0"},
                {"Днепропетровск (Украина)", "0"},
                {"Донецк (ДНР)", "0"},
                {"Дортмунд (Германия)", "0"},
                {"Доха (Катар)", "0"},
                {"Дрезден (Германия)", "0"},
                {"Дубай (ОАЭ)", "0"},
                {"Дублин (Ирландия)", "0"},
                {"Дубровник (Хорватия)", "0"},
                {"Дуйсбург (Германия)", "0"},
                {"Дурбан (ЮАР)", "0"},
                {"Душанбе (Таджикистан)", "0"},
                {"Дюссельдорф (Германия)", "0"}};
        final String[][] C5 = {{"Евпатория (Россия) ", "0"},
                {"Ейск (Россия) ", "0"},
                {"Екатеринбург (Россия)", "0"},
                {"Ереван (Армения)", "0"},
                {"Ессентуки (Россия)", "0"}};
        final String[][] C6 = {{"Женева (Швейцария)", "0"},
                {"Житомир (Украина)", "0"}};
        final String[][] C7 = {{"Загреб (Хорватия)", "0"},
                {"Задар (Хорватия)", "0"},
                {"Закинтос (Греция)", "0"},
                {"Закопане (Польша)", "0"},
                {"Зальцбург (Австрия)", "0"},
                {"Запорожье (Украина)", "0"},
                {"Золотые Пески (Болгария)", "0"}};
        final String[][] C8 = {{"Ибица (Испания)", "0"},
                {"Иваново (Россия)", "0"},
                {"Иерусалим (Израиль)", "0"},
                {"Ижевск (Россия)", "0"},
                {"Измир (Турция)", "0"},
                {"Иматра (Финляндия)", "0"},
                {"Инсбрук (Австрия)", "0"},
                {"Ираклион (Греция)", "0"},
                {"Иркутск (Россия)", "0"},
                {"Исламабад (Пакистан)", "0"}};
        final String[][] C9 = {{"Йокогама (Япония)", "0"},
                {"Йоханнесбург (ЮАР)", "0"},
                {"Йошкар-Ола (Россия)", "0"}};
        final String[][] C10 = {{"Кабул (Афганистан)", "0"},
                {"Кавала (Греция)", "0"},
                {"Кадис (Испания)", "0"},
                {"Казань (Россия)", "0"},
                {"Каир (Египет)", "0"},
                {"Калгари (Канада)", "0"},
                {"Калининград (Россия)", "0"},
                {"Калуга (Россия)", "0"},
                {"Калькутта (Индия)", "0"},
                {"Кальяри (Италия)", "0"},
                {"Канберра (Австралия)", "0"},
                {"Кандагар (Афганистан)", "0"},
                {"Канкун (Мексика)", "0"},
                {"Канны (Франция)", "0"},
                {"Караганда (Казахстан)", "0"},
                {"Каракас (Венесуэла)", "0"},
                {"Карачи (Пакистан)", "0"},
                {"Карловы Вары (Чехия)", "0"},
                {"Карлсруэ (Германия)", "0"},
                {"Касабланка (Марокко)", "0"},
                {"Катманду (Непал)", "0"},
                {"Катовице (Польша)", "0"},
                {"Квебек (Канада)", "0"},
                {"Кейптаун (ЮАР)", "0"},
                {"Кельн (Германия)", "0"},
                {"Кемер (Турция)", "0"},
                {"Кемерово (Россия)", "0"},
                {"Керкира (Греция)", "0"},
                {"Керчь (Россия)", "0"},
                {"Киев (Украина)", "0"},
                {"Киров (Россия)", "0"},
                {"Кисловодск (Россия)", "0"},
                {"Кито (Эквадор)", "0"},
                {"Кишинев (Молдавия)", "0"},
                {"Клагенфурт (Австрия)", "0"},
                {"Коктебель (Россия) ", "0"},
                {"Коломбо (Шри-Ланка)", "0"},
                {"Комсомольск-на-Амуре (Россия)", "0"},
                {"Конаклы (Турция)", "0"},
                {"Копенгаген (Дания)", "0"},
                {"Костанай (Казахстан)", "0"},
                {"Кострома (Россия)", "0"},
                {"Кота-Кинабалу (Малайзия)", "0"},
                {"Котор (Черногория)", "0"},
                {"Кошице (Словакия)", "0"},
                {"Краби (Таиланд)", "0"},
                {"Краков (Польша)", "0"},
                {"Кранево (Болгария)", "0"},
                {"Краснодар (Россия)", "0"},
                {"Красноярск (Россия)", "0"},
                {"Кривой Рог (Украина)", "0"},
                {"Куала-Лумпур (Малайзия)", "0"},
                {"Куопио (Финляндия)", "0"},
                {"Курган (Россия)", "0"},
                {"Курск (Россия)", "0"},
                {"Куршавель (Франция)", "0"},
                {"Кучинг (Малайзия)", "0"},
                {"Кушадасы (Турция)", "0"},
                {"Кызыл (Россия)", "0"}};
        final String[][] C11 = {{"Лагос (Нигерия)", "0"},
                {"Лангкави (Малайзия)", "0"},
                {"Ла-Пас (Боливия)", "0"},
                {"Ла-Пинеда (Испания)", "0"},
                {"Ларнака (Кипр)", "0"},
                {"Лас-Вегас (США)", "0"},
                {"Лас-Пальмас-де-Гран-Канария (Испания)", "0"},
                {"Лахти (Финляндия)", "0"},
                {"Лейпциг (Германия)", "0"},
                {"Ливерпуль (Великобритания)", "0"},
                {"Лидс (Великобритания)", "0"},
                {"Лима (Перу)", "0"},
                {"Лимассол (Кипр)", "0"},
                {"Линц (Австрия)", "0"},
                {"Лион (Франция)", "0"},
                {"Липецк (Россия)", "0"},
                {"Лиссабон (Португалия)", "0"},
                {"Ллорет-де-Мар (Испания)", "0"},
                {"Лодзь (Польша)", "0"},
                {"Лозанна (Швейцария)", "0"},
                {"Лондон (Великобритания)", "0"},
                {"Лос-Анджелес (США)", "0"},
                {"Луанда (Ангола)", "0"},
                {"Лугано (Швейцария)", "0"},
                {"Луганск (ЛНР)", "0"},
                {"Луксор (Египет)", "0"},
                {"Лутраки (Греция)", "0"},
                {"Лхаса (Китай)", "0"},
                {"Львов (Украина)", "0"},
                {"Льеж (Бельгия)", "0"},
                {"Любек (Германия)", "0"},
                {"Люблин (Польша)", "0"},
                {"Любляна (Словения)", "0"},
                {"Люцерн (Швейцария)", "0"}};
        final String[][] C12 = {{"Маастрихт (Нидерланды)", "0"},
                {"Магадан (Россия)", "0"},
                {"Магнитогорск (Россия)", "0"},
                {"Мадрид (Испания)", "0"},
                {"Майами (США)", "0"},
                {"Майкоп (Россия)", "0"},
                {"Малага (Испания)", "0"},
                {"Мале (Мальдивы)", "0"},
                {"Мальме (Швеция)", "0"},
                {"Манавгат (Турция)", "0"},
                {"Манагуа (Никарагуа)", "0"},
                {"Манаус (Бразилия)", "0"},
                {"Манила (Филиппины)", "0"},
                {"Манчестер (Великобритания)", "0"},
                {"Марианские Лазни (Чехия)", "0"},
                {"Мармарис (Турция)", "0"},
                {"Марса-Алам (Египет)", "0"},
                {"Марсель (Франция)", "0"},
                {"Маскат (Оман)", "0"},
                {"Махачкала (Россия)", "0"},
                {"Махдия (Тунис)", "0"},
                {"Махмутлар (Турция)", "0"},
                {"Медина (Саудовская Аравия)", "0"},
                {"Мекка (Саудовская Аравия)", "0"},
                {"Мельбурн (Австралия)", "0"},
                {"Мерида (Мексика)", "0"},
                {"Мехико (Мексика)", "0"},
                {"Мешхед (Иран)", "0"},
                {"Милан (Италия)", "0"},
                {"Минеральные Воды (Россия) ", "0"},
                {"Минск (Белоруссия)", "0"},
                {"Мишкольц (Венгрия)", "0"},
                {"Могилев (Белоруссия)", "0"},
                {"Момбаса (Кения)", "0"},
                {"Монастир (Тунис)", "0"},
                {"Монреаль (Канада)", "0"},
                {"Монтевидео (Уругвай)", "0"},
                {"Москва (Россия)", "0"},
                {"Муйне (Вьетнам)", "0"},
                {"Мумбаи (Индия)", "0"},
                {"Мурманск (Россия)", "0"},
                {"Мурсия (Испания)", "0"},
                {"Мюнстер (Германия)", "0"},
                {"Мюнхен (Германия)", "0"}};
        final String[][] C13 = {{"Набережные Челны (Россия)", "0"},
                {"Назарет (Израиль)", "0"},
                {"Назрань (Россия)", "0"},
                {"Найроби (Кения)", "0"},
                {"Нальчик (Россия)", "0"},
                {"Нанкин (Китай)", "0"},
                {"Нант (Франция)", "0"},
                {"Нарьян-Мар (Россия)", "0"},
                {"Нассау (Багамы)", "0"},
                {"Неаполь (Италия)", "0"},
                {"Несебр (Болгария)", "0"},
                {"Нетания (Израиль)", "0"},
                {"Нефтеюганск (Россия)", "0"},
                {"Нижневартовск (Россия)", "0"},
                {"Нижний Новгород (Россия)", "0"},
                {"Нижний Тагил (Россия)", "0"},
                {"Николаев (Украина)", "0"},
                {"Никосия (Кипр)", "0"},
                {"Ницца (Франция)", "0"},
                {"Новгород Великий (Россия)", "0"},
                {"Нови-Сад (Сербия)", "0"},
                {"Новокузнецк (Россия)", "0"},
                {"Новороссийск (Россия)", "0"},
                {"Новосибирск (Россия)", "0"},
                {"Новый Орлеан (США)", "0"},
                {"Новый Уренгой (Россия)", "0"},
                {"Норильск (Россия)", "0"},
                {"Ноябрьск (Россия)", "0"},
                {"Нувейба (Египет)", "0"},
                {"Нью-Йорк (США)", "0"},
                {"Нюрнберг (Германия)", "0"},
                {"Нячанг (Вьетнам)", "0"}};
        final String[][] C14 = {{"Одесса (Украина)", "0"},
                {"Окленд (Новая Зеландия)", "0"},
                {"Оломоуц (Чехия)", "0"},
                {"Ольборг (Дания)", "0"},
                {"Олюдениз (Турция)", "0"},
                {"Омск (Россия)", "0"},
                {"Орел (Россия)", "0"},
                {"Оренбург (Россия)", "0"},
                {"Орлеан (Франция)", "0"},
                {"Орск (Россия) ", "0"},
                {"Орхус (Дания)", "0"},
                {"Осака (Япония)", "0"},
                {"Осло (Норвегия)", "0"},
                {"Острава (Чехия)", "0"},
                {"Оттава (Канада)", "0"},
                {"Оулу (Финляндия)", "0"},
                {"Охрид (Македония)", "0"}};
        final String[][] C15 = {{"Павлодар (Казахстан)", "0"},
                {"Падуя (Италия)", "0"},
                {"Палермо (Италия)", "0"},
                {"Пальма-де-Майорка (Испания)", "0"},
                {"Панама (Панама)", "0"},
                {"Пардубице (Чехия)", "0"},
                {"Париж (Франция)", "0"},
                {"Патры (Греция)", "0"},
                {"Паттайя (Таиланд)", "0"},
                {"Пафос (Кипр)", "0"},
                {"Пекин (Китай)", "0"},
                {"Пенанг (Малайзия)", "0"},
                {"Пенза (Россия)", "0"},
                {"Пермь (Россия)", "0"},
                {"Перт (Австралия)", "0"},
                {"Петрозаводск (Россия)", "0"},
                {"Петропавловск (Казахстан)", "0"},
                {"Петропавловск-Камчатский (Россия)", "0"},
                {"Пиза (Италия)", "0"},
                {"Плайя-дель-Кармен (Мексика)", "0"},
                {"Пловдив (Болгария)", "0"},
                {"Пльзень (Чехия)", "0"},
                {"Пномпень (Камбоджа)", "0"},
                {"Подгорица (Черногория)", "0"},
                {"Познань (Польша)", "0"},
                {"Полтава (Украина)", "0"},
                {"Поморие (Болгария)", "0"},
                {"Попрад (Словакия)", "0"},
                {"Порвоо (Финляндия)", "0"},
                {"Пореч (Хорватия)", "0"},
                {"Порту (Португалия)", "0"},
                {"Прага (Чехия)", "0"},
                {"Претория (ЮАР)", "0"},
                {"Протарас (Кипр)", "0"},
                {"Псков (Россия)", "0"},
                {"Пула (Хорватия)", "0"},
                {"Пунта-Кана (Доминикана)", "0"},
                {"Пусан (Южная Корея)", "0"},
                {"Пуэрто-Плата (Доминикана)", "0"},
                {"Пхеньян (КНДР)", "0"},
                {"Пхукет (Таиланд)", "0"},
                {"Пятигорск (Россия)", "0"}};
        final String[][] C16 = {{"Рабат (Марокко)", "0"},
                {"Равда (Болгария)", "0"},
                {"Регенсбург (Германия)", "0"},
                {"Рейкьявик (Исландия)", "0"},
                {"Реймс (Франция)", "0"},
                {"Ресифи (Бразилия)", "0"},
                {"Ретимно (Греция)", "0"},
                {"Рига (Латвия)", "0"},
                {"Риека (Хорватия)", "0"},
                {"Рим (Италия)", "0"},
                {"Римини (Италия)", "0"},
                {"Рио-де-Жанейро (Бразилия)", "0"},
                {"Рованиеми (Финляндия)", "0"},
                {"Ровно (Украина)", "0"},
                {"Родос (Греция)", "0"},
                {"Ростов-на-Дону (Россия)", "0"},
                {"Росток (Германия)", "0"},
                {"Роттердам (Нидерланды)", "0"},
                {"Рязань (Россия)", "0"}};
        final String[][] C17 = {{"Салвадор (Бразилия)", "0"},
                {"Салехард (Россия)", "0"},
                {"Салоники (Греция)", "0"},
                {"Салоу (Испания)", "0"},
                {"Самара (Россия)", "0"},
                {"Самарканд (Узбекистан)", "0"},
                {"Сан-Диего (США)", "0"},
                {"Санкт-Петербург (Россия)", "0"},
                {"Сан-Паулу (Бразилия)", "0"},
                {"Сан-Ремо (Италия)", "0"},
                {"Санто-Доминго (Доминикана)", "0"},
                {"Сантьяго (Чили)", "0"},
                {"Сантьяго-де-Куба (Куба)", "0"},
                {"Сан-Франциско (США)", "0"},
                {"Санья (Китай)", "0"},
                {"Саппоро (Япония)", "0"},
                {"Сарагоса (Испания)", "0"},
                {"Саранск (Россия)", "0"},
                {"Саратов (Россия)", "0"},
                {"Себу (Филиппины)", "0"},
                {"Севастополь (Россия)", "0"},
                {"Севилья (Испания)", "0"},
                {"Сегед (Венгрия)", "0"},
                {"Сеул (Южная Корея)", "0"},
                {"Сиануквиль (Камбоджа)", "0"},
                {"Сиань (Китай)", "0"},
                {"Сиде (Турция)", "0"},
                {"Сидней (Австралия)", "0"},
                {"Сиемреап (Камбоджа)", "0"},
                {"Сиена (Италия)", "0"},
                {"Симферополь (Россия)", "0"},
                {"Сиэтл (США)", "0"},
                {"Скопье (Македония)", "0"},
                {"Смоленск (Россия)", "0"},
                {"Созополь (Болгария)", "0"},
                {"Сопот (Польша)", "0"},
                {"Сорренто (Италия)", "0"},
                {"София (Болгария)", "0"},
                {"Сочи (Россия)", "0"},
                {"Спарта (Греция)", "0"},
                {"Сплит (Хорватия)", "0"},
                {"Ставангер (Норвегия)", "0"},
                {"Ставрополь (Россия)", "0"},
                {"Стамбул (Турция)", "0"},
                {"Стара-Загора (Болгария)", "0"},
                {"Стерлитамак (Россия)", "0"},
                {"Страсбург (Франция)", "0"},
                {"Стокгольм (Швеция)", "0"},
                {"Сува (Фиджи)", "0"},
                {"Сумы (Украина)", "0"},
                {"Сургут (Россия)", "0"},
                {"Сусс (Тунис)", "0"},
                {"Сухуми (Абхазия)", "0"},
                {"Сыктывкар (Россия)", "0"}};
        final String[][] C18 = {{"Таба (Египет)", "0"},
                {"Таганрог (Россия)", "0"},
                {"Тайбэй (Тайвань)", "0"},
                {"Таллин (Эстония)", "0"},
                {"Тамбов (Россия)", "0"},
                {"Тампере (Финляндия)", "0"},
                {"Таррагона (Испания)", "0"},
                {"Ташкент (Узбекистан)", "0"},
                {"Тбилиси (Грузия)", "0"},
                {"Тверь (Россия)", "0"},
                {"Тебриз (Иран)", "0"},
                {"Тегеран (Иран)", "0"},
                {"Тель-Авив (Израиль)", "0"},
                {"Тенерифе (Испания)", "0"},
                {"Теплице (Чехия)", "0"},
                {"Тернополь (Украина)", "0"},
                {"Тиват (Черногория)", "0"},
                {"Тирана (Албания)", "0"},
                {"Токио (Япония)", "0"},
                {"Тольятти (Россия)", "0"},
                {"Томар (Португалия)", "0"},
                {"Томск (Россия)", "0"},
                {"Торонто (Канада)", "0"},
                {"Тосса-де-Мар (Испания)", "0"},
                {"Трабзон (Турция)", "0"},
                {"Триест (Италия)", "0"},
                {"Тромсе (Норвегия)", "0"},
                {"Тронхейм (Норвегия)", "0"},
                {"Туапсе (Россия) ", "0"},
                {"Тула (Россия)", "0"},
                {"Тулон (Франция)", "0"},
                {"Тулуза (Франция)", "0"},
                {"Турин (Италия)", "0"},
                {"Тунис (Тунис)", "0"},
                {"Турку (Финляндия)", "0"},
                {"Тюмень (Россия)", "0"},
                {"Тяньцзинь (Китай)", "0"}};
        final String[][] C19 = {{"Улан-Батор (Монголия)", "0"},
                {"Улан-Удэ (Россия)", "0"},
                {"Ульяновск (Россия)", "0"},
                {"Урумчи (Китай)", "0"},
                {"Усть-Каменогорск (Казахстан)", "0"},
                {"Утрехт (Нидерланды)", "0"},
                {"Уфа (Россия)", "0"},
                {"Ухань (Китай)", "0"}};
        final String[][] C20 = {{"Фалираки (Греция)", "0"},
                {"Фамагуста (Северный Кипр)", "0"},
                {"Фантхьет (Вьетнам)", "0"},
                {"Фару (Португалия)", "0"},
                {"Феодосия (Россия) ", "0"},
                {"Фетхие (Турция)", "0"},
                {"Филадельфия (США)", "0"},
                {"Флоренция (Италия)", "0"},
                {"Фрайбург (Германия)", "0"},
                {"Франкфурт-на-Майне (Германия)", "0"},
                {"Фрипорт (Багамы)", "0"},
                {"Фуджейра (ОАЭ)", "0"},
                {"Фукусима (Япония)", "0"},
                {"Фуншал (Португалия)", "0"}};
        final String[][] C21 = {{"Хабаровск (Россия)", "0"},
                {"Хайфа (Израиль)", "0"},
                {"Хаммамет (Тунис)", "0"},
                {"Ханой (Вьетнам)", "0"},
                {"Ханты-Мансийск (Россия)", "0"},
                {"Ханья (Греция)", "0"},
                {"Харбин (Китай)", "0"},
                {"Харьков (Украина)", "0"},
                {"Хевиз (Венгрия)", "0"},
                {"Хельсинки (Финляндия)", "0"},
                {"Херсон (Украина)", "0"},
                {"Херсониссос (Греция)", "0"},
                {"Хошимин (Вьетнам)", "0"},
                {"Хуа Хин (Таиланд)", "0"},
                {"Хургада (Египет)", "0"},
                {"Хьюстон (США)", "0"},
                {"Хэйхэ (Китай)", "0"}};
        final String[][] C22 = {{"Церматт (Швейцария)", "0"},
                {"Цюрих (Швейцария)", "0"}};
        final String[][] C23 = {{"Чебоксары (Россия)", "0"},
                {"Челябинск (Россия)", "0"},
                {"Ченнаи (Индия)", "0"},
                {"Череповец (Россия)", "0"},
                {"Черкассы (Украина)", "0"},
                {"Черкесск (Россия)", "0"},
                {"Чернигов (Украина)", "0"},
                {"Чиангмай (Таиланд)", "0"},
                {"Чикаго (США)", "0"},
                {"Чита (Россия)", "0"},
                {"Чунцин (Китай)", "0"}};
        final String[][] C24 = {{"Шанхай (Китай)", "0"},
                {"Шарджа (ОАЭ)", "0"},
                {"Шарм-эль-Шейх (Египет)", "0"},
                {"Шеньжень (Китай)", "0"},
                {"Шеньян (Китай)", "0"},
                {"Штутгарт (Германия)", "0"}};
        final String[][] C25 = {{"Щецин (Польша)", "0"}};
        final String[][] C26 = {{"Эдинбург (Великобритания)", "0"},
                {"Эдмонтон (Канада)", "0"},
                {"Эйлат (Израиль)", "0"},
                {"Элиста (Россия)", "0"},
                {"Эльблонг (Польша)", "0"},
                {"Эль-Гуна (Египет)", "0"},
                {"Эр-Рияд (Саудовская Аравия)", "0"}};
        final String[][] C27 = {{"Южно-Сахалинск (Россия)", "0"}};
        final String[][] C28 = {{"Якутск (Россия)", "0"},
                {"Ялта (Россия)", "0"},
                {"Янгон (Мьянма)", "0"},
                {"Ярославль (Россия)", "0"},
                {"Яссы (Румыния)", "0"}};


}

